<?php

namespace SAPF\Filter;

class FilterWash extends \SAPF\Filter\FilterNormalize
{

    protected $_space = '-';
    protected $_allow = '.()';
    protected $_from = array(
        'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'ф', 'ы', 'в', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'Ф', 'Ы', 'В',
        'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю',
        'á', 'ä', 'č', 'ď', 'é', 'í', 'ĺ', 'ľ', 'ň', 'ô', 'ó', 'ŕ', 'š', 'ť', 'ú', 'ý', 'ž', 'Á', 'Ä', 'Č', 'Ď', 'É', 'Í', 'Ĺ', 'Ľ', 'Ň', 'Ô', 'Ó', 'Ŕ', 'Š', 'Ť', 'Ú', 'Ý', 'Ž',
        'ä', 'ö', 'ü', 'ß', 'Ä', 'Ö', 'Ü',
        'ą', 'ć', 'ę', 'ł', 'ń', 'ó', 'ś', 'ź', 'ż', 'Ą', 'Ć', 'Ę', 'Ł', 'Ń', 'Ó', 'Ś', 'Ź', 'Ż',
    );
    protected $_to   = array(
        'i', 'c', 'u', 'k', 'e', 'n', 'g', 'sz', 'szcz', 'z', 'ch', '', 'f', 'y', 'v', 'I', 'C', 'U', 'K', 'E', 'N', 'G', 'Sz', 'Szcz', 'Z', 'Ch', '', 'F', 'Y', 'V',
        'a', 'p', 'r', 'o', 'l', 'd', 'z', 'z', 'ja', 'c', 's', 'm', 'i', 't', '', 'b', 'ju', 'A', 'P', 'R', 'O', 'L', 'D', 'Z', 'Z', 'Ja', 'C', 'S', 'M', 'I', 'T', '', 'B', 'Ju',
        'a', 'a', 'c', 'd', 'e', 'i', 'l', 'l', 'n', 'o', 'o', 'r', 's', 't', 'u', 'y', 'z', 'A', 'A', 'C', 'D', 'E', 'I', 'L', 'L', 'N', 'O', 'O', 'R', 'S', 'T', 'U', 'Y', 'Z',
        'ae', 'oe', 'ue', 'ss', 'Ae', 'Oe', 'Ue',
        'a', 'c', 'e', 'l', 'n', 'o', 's', 'z', 'z', 'A', 'C', 'E', 'L', 'N', 'O', 'S', 'Z', 'Z',
    );

    public function filter($input)
    {
        $string = str_replace($this->_from, $this->_to, $input);
        return parent::filter($string);
    }

}
